 const prayers = {
    title:"أدعية الأنبياء في القرآن الكريم",
    items:[
        {
        name:"دعاء آدم عليه السلام:",
        item:[
            {
                start:" قال تعالى:",
                prayer:"﴿ قَالَا رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ ﴾",
                reference:"[الأعراف: 23]."

            }
        ]
        },
        {
            name:"دعاء نوح عليه السلام:",
            item:[
                {
                    start:" قال تعالى:",
                    prayer:"﴿ وَنَادَى نُوحٌ رَبَّهُ فَقَالَ رَبِّ إِنَّ ابْنِي مِنْ أَهْلِي وَإِنَّ وَعْدَكَ الْحَقُّ وَأَنْتَ أَحْكَمُ الْحَاكِمِينَ ﴾",
                     reference:"[هود: 45]."
                },
                {
                    start:" قال تعالى:",
                    prayer:"﴿ قَالَ رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلَّا تَغْفِرْ لِي وَتَرْحَمْنِي أَكُنْ مِنَ الْخَاسِرِينَ ﴾" ,
                     reference:"[هود: 47]."
                },
                {
                    start:" قال تعالى:",
                    prayer:"﴿ قَالَ رَبِّ إِنَّ قَوْمِي كَذَّبُونِ * فَافْتَحْ بَيْنِي وَبَيْنَهُمْ فَتْحًا وَنَجِّنِي وَمَنْ مَعِيَ مِنَ الْمُؤْمِنِينَ ﴾" ,
                     reference:"[الشعراء: 117، 118]."
                },
                {
                    start:" قال تعالى:",
                    prayer:"﴿ فَدَعَا رَبَّهُ أَنِّي مَغْلُوبٌ فَانْتَصِرْ ﴾" ,
                     reference:"[القمر: 10]."
                },
                {
                    start:" قال تعالى:",
                    prayer:"﴿ وَقَالَ نُوحٌ رَبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا * إِنَّكَ إِنْ تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا * رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا ﴾"  ,
                     reference:" [نوح: 26 - 28]."
                },
            ]
            },
            {
                name:"دعاء إبراهيم عليه السلام:",
                item:[
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَذَا بَلَدًا آمِنًا وَارْزُقْ أَهْلَهُ مِنَ الثَّمَرَاتِ مَنْ آمَنَ مِنْهُمْ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ﴾" ,
                         reference:"[البقرة: 126]."
                    },
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَنْ نَعْبُدَ الْأَصْنَامَ * رَبِّ إِنَّهُنَّ أَضْلَلْنَ كَثِيرًا مِنَ النَّاسِ فَمَنْ تَبِعَنِي فَإِنَّهُ مِنِّي وَمَنْ عَصَانِي فَإِنَّكَ غَفُورٌ رَحِيمٌ * رَبَّنَا إِنِّي أَسْكَنْتُ مِنْ ذُرِّيَّتِي بِوَادٍ غَيْرِ ذِي زَرْعٍ عِنْدَ بَيْتِكَ الْمُحَرَّمِ رَبَّنَا لِيُقِيمُوا الصَّلَاةَ فَاجْعَلْ أَفْئِدَةً مِنَ النَّاسِ تَهْوِي إِلَيْهِمْ وَارْزُقْهُمْ مِنَ الثَّمَرَاتِ لَعَلَّهُمْ يَشْكُرُونَ * رَبَّنَا إِنَّكَ تَعْلَمُ مَا نُخْفِي وَمَا نُعْلِنُ وَمَا يَخْفَى عَلَى اللَّهِ مِنْ شَيْءٍ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ * الْحَمْدُ لِلَّهِ الَّذِي وَهَبَ لِي عَلَى الْكِبَرِ إِسْمَاعِيلَ وَإِسْحَاقَ إِنَّ رَبِّي لَسَمِيعُ الدُّعَاءِ * رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ * رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ ﴾" ,
                         reference:"[إبراهيم: 35 - 41]."
                    },
                    {
                        start:" قال تعالى:",
                        prayer:" ﴿ رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ * وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الْآخِرِينَ * وَاجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيمِ * وَاغْفِرْ لِأَبِي إِنَّهُ كَانَ مِنَ الضَّالِّينَ * وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَ * يَوْمَ لَا يَنْفَعُ مَالٌ وَلَا بَنُونَ * إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ ﴾" ,
                         reference:"[الشعراء: 83 - 89]."
                    },
                    {
                        start:" قال تعالى:",
                        prayer:" ﴿ رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ  ﴾" ,
                         reference:"[الصافات: 100]."
                    },
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ وَإِذْ يَرْفَعُ إِبْرَاهِيمُ الْقَوَاعِدَ مِنَ الْبَيْتِ وَإِسْمَاعِيلُ رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ * رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَّتِنَا أُمَّةً مُسْلِمَةً لَكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ * رَبَّنَا وَابْعَثْ فِيهِمْ رَسُولًا مِنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِكَ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَيُزَكِّيهِمْ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ ﴾" ,
                         reference:"[البقرة: 127 - 129]."
                    },
                    
                ]
            },
            {
                name:"دعاء لوط عليه السلام:",
                item:[
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ قَالَ رَبِّ انْصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ ﴾" ,
                         reference:"[العنكبوت: 30]."
                    },
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ رَبِّ نَجِّنِي وَأَهْلِي مِمَّا يَعْمَلُونَ ﴾" ,
                         reference:"[الشعراء: 169]."
                    }
                ]
            },
            {
                name:"دعاء  يوسف  عليه السلام:",
                item:[
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ قَالَ رَبِّ السِّجْنُ أَحَبُّ إِلَيَّ مِمَّا يَدْعُونَنِي إِلَيْهِ وَإِلَّا تَصْرِفْ عَنِّي كَيْدَهُنَّ أَصْبُ إِلَيْهِنَّ وَأَكُنْ مِنَ الْجَاهِلِينَ * فَاسْتَجَابَ لَهُ رَبُّهُ فَصَرَفَ عَنْهُ كَيْدَهُنَّ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ ﴾" ,
                         reference:"[يوسف: 33، 34]."
                    },
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ وَعَلَّمْتَنِي مِنْ تَأْوِيلِ الْأَحَادِيثِ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنْتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ ﴾" ,
                         reference:"[يوسف: 101]."
                    },
                ]
            },
            {
                name:"دعاء موسى عليه السلام:",
                item:[
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ قَالَ رَبِّ إِنِّي لَا أَمْلِكُ إِلَّا نَفْسِي وَأَخِي فَافْرُقْ بَيْنَنَا وَبَيْنَ الْقَوْمِ الْفَاسِقِينَ ﴾" ,
                        reference:"[المائدة: 25]."
            },
            {
                start:" قال تعالى:",
                prayer:"﴿ قَالَ رَبِّ اغْفِرْ لِي وَلِأَخِي وَأَدْخِلْنَا فِي رَحْمَتِكَ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ ﴾" ,
                 reference:"[الأعراف: 151]."
            },
            {
                start:" قال تعالى:",
                prayer:"﴿ وَاخْتَارَ مُوسَى قَوْمَهُ سَبْعِينَ رَجُلًا لِمِيقَاتِنَا فَلَمَّا أَخَذَتْهُمُ الرَّجْفَةُ قَالَ رَبِّ لَوْ شِئْتَ أَهْلَكْتَهُمْ مِنْ قَبْلُ وَإِيَّايَ أَتُهْلِكُنَا بِمَا فَعَلَ السُّفَهَاءُ مِنَّا إِنْ هِيَ إِلَّا فِتْنَتُكَ تُضِلُّ بِهَا مَنْ تَشَاءُ وَتَهْدِي مَنْ تَشَاءُ أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الْغَافِرِينَ * وَاكْتُبْ لَنَا فِي هَذِهِ الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ إِنَّا هُدْنَا إِلَيْكَ ﴾" ,
                 reference:"[الأعراف: 155، 156]."
            },
            {
                start:" قال تعالى:",
                prayer:" ﴿ وَقَالَ مُوسَى رَبَّنَا إِنَّكَ آتَيْتَ فِرْعَوْنَ وَمَلَأَهُ زِينَةً وَأَمْوَالًا فِي الْحَيَاةِ الدُّنْيَا رَبَّنَا لِيُضِلُّوا عَنْ سَبِيلِكَ رَبَّنَا اطْمِسْ عَلَى أَمْوَالِهِمْ وَاشْدُدْ عَلَى قُلُوبِهِمْ فَلَا يُؤْمِنُوا حَتَّى يَرَوُا الْعَذَابَ الْأَلِيمَ ﴾" ,
                 reference:"[يونس: 88]."
            },
            {
                start:" قال تعالى:",
                prayer:"﴿ قَالَ رَبِّ اشْرَحْ لِي صَدْرِي * وَيَسِّرْ لِي أَمْرِي * وَاحْلُلْ عُقْدَةً مِنْ لِسَانِي * يَفْقَهُوا قَوْلِي * وَاجْعَلْ لِي وَزِيرًا مِنْ أَهْلِي * هَارُونَ أَخِي * اشْدُدْ بِهِ أَزْرِي * وَأَشْرِكْهُ فِي أَمْرِي * كَيْ نُسَبِّحَكَ كَثِيرًا * وَنَذْكُرَكَ كَثِيرًا * إِنَّكَ كُنْتَ بِنَا بَصِيرًا * قَالَ قَدْ أُوتِيتَ سُؤْلَكَ يَا مُوسَى ﴾" ,
                 reference:"[طه: 25 - 36]."
            },
            {
                start:" قال تعالى:",
                prayer:"﴿ قَالَ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَغَفَرَ لَهُ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ * قَالَ رَبِّ بِمَا أَنْعَمْتَ عَلَيَّ فَلَنْ أَكُونَ ظَهِيرًا لِلْمُجْرِمِينَ ﴾" ,
                 reference:"[القصص: 16، 17]."
            },
            {
                start:" قال تعالى:",
                prayer:" ﴿ فَخَرَجَ مِنْهَا خَائِفًا يَتَرَقَّبُ قَالَ رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ * وَلَمَّا تَوَجَّهَ تِلْقَاءَ مَدْيَنَ قَالَ عَسَى رَبِّي أَنْ يَهْدِيَنِي سَوَاءَ السَّبِيلِ ﴾" ,
                 reference:"[القصص: 21، 22]."
            },
            {
                start:" قال تعالى:",
                prayer:"﴿ فَسَقَى لَهُمَا ثُمَّ تَوَلَّى إِلَى الظِّلِّ فَقَالَ رَبِّ إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ ﴾" ,
                 reference:"[القصص: 24]."
            },
            {
                start:" قال تعالى:",
                prayer:"﴿ قَالَ رَبِّ إِنِّي قَتَلْتُ مِنْهُمْ نَفْسًا فَأَخَافُ أَنْ يَقْتُلُونِ * وَأَخِي هَارُونُ هُوَ أَفْصَحُ مِنِّي لِسَانًا فَأَرْسِلْهُ مَعِيَ رِدْءًا يُصَدِّقُنِي إِنِّي أَخَافُ أَنْ يُكَذِّبُونِ ﴾" ,
                 reference:"[القصص: 33، 34]."
            },
            {
                start:" قال تعالى:",
                prayer:"﴿ وَقَالَ مُوسَى إِنِّي عُذْتُ بِرَبِّي وَرَبِّكُمْ مِنْ كُلِّ مُتَكَبِّرٍ لَا يُؤْمِنُ بِيَوْمِ الْحِسَابِ ﴾" ,
                 reference:"[غافر: 27]."
            }
                ]
            },
            {
                name:"دعاء شعيب  عليه السلام:",
                item:[
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنْتَ خَيْرُ الْفَاتِحِينَ ﴾" ,
                         reference:"[الأعراف: 89]."
                    },
                ]
            },
            {
                name:"دعاء يونس عليه السلام:",
                item:[
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ وَذَا النُّونِ إِذْ ذَهَبَ مُغَاضِبًا فَظَنَّ أَنْ لَنْ نَقْدِرَ عَلَيْهِ فَنَادَى فِي الظُّلُمَاتِ أَنْ لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ ﴾" ,
                         reference:"[الأنبياء: 87]."
                    },
                ]
            },
            {
                name:"دعاء أيوب  عليه السلام:",
                item:[
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ وَأَيُّوبَ إِذْ نَادَى رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ ﴾" ,
                         reference:"[الأنبياء: 83]."
                    },
                    {
                        start:" قال تعالى:",
                        prayer:" ﴿ وَاذْكُرْ عَبْدَنَا أَيُّوبَ إِذْ نَادَى رَبَّهُ أَنِّي مَسَّنِيَ الشَّيْطَانُ بِنُصْبٍ وَعَذَابٍ ﴾" ,
                         reference:"[ص: 41]."
                    },
                    {
                    start:" قال تعالى:",
                    prayer:"" ,
                     reference:""
                },
                ]
            },
            {
                name:"دعاء سليمان عليه السلام:",
                item:[
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ ﴾" ,
                         reference:"[النمل: 19]."
                    },
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ قَالَ رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَا يَنْبَغِي لِأَحَدٍ مِنْ بَعْدِي إِنَّكَ أَنْتَ الْوَهَّابُ ﴾" ,
                         reference:"[ص: 35]."
                    },
                ]
            },
            {
                name:"دعاء زكريا عليه السلام:",
                item:[
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ رَبِّ إِنِّي وَهَنَ الْعَظْمُ مِنِّي وَاشْتَعَلَ الرَّأْسُ شَيْبًا وَلَمْ أَكُنْ بِدُعَائِكَ رَبِّ شَقِيًّا * وَإِنِّي خِفْتُ الْمَوَالِيَ مِنْ وَرَائِي وَكَانَتِ امْرَأَتِي عَاقِرًا فَهَبْ لِي مِنْ لَدُنْكَ وَلِيًّا * يَرِثُنِي وَيَرِثُ مِنْ آلِ يَعْقُوبَ وَاجْعَلْهُ رَبِّ رَضِيًّا ﴾" ,
                         reference:"[مريم: 4 - 6]."
                    },
                    {
                        start:" قال تعالى:",
                        prayer:" ﴿ رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ ﴾ " ,
                         reference:"[آل عمران: 38]."
                    },
                    {
                        start:" قال تعالى:",
                        prayer:" ﴿ رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنْتَ خَيْرُ الْوَارِثِينَ ﴾" ,
                         reference:"[الأنبياء: 89]."
                    },
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ رَبِّ اجْعَلْ لِي آيَةً ﴾" ,
                         reference:" [آل عمران: 41]،  [مريم: 10] في موضعين"
                    },
                ]
            },
            {
                name:"دعاء عيسى عليه السلام:",
                item:[
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ قَالَ عِيسَى ابْنُ مَرْيَمَ اللَّهُمَّ رَبَّنَا أَنْزِلْ عَلَيْنَا مَائِدَةً مِنَ السَّمَاءِ تَكُونُ لَنَا عِيدًا لِأَوَّلِنَا وَآخِرِنَا وَآيَةً مِنْكَ وَارْزُقْنَا وَأَنْتَ خَيْرُ الرَّازِقِينَ ﴾ " ,
                         reference:"[المائدة: 114]."
                    },

                ]
            },
            {
                name:"دعاء نبينا محمد صلى الله عليه وسلم:",
                item:[
                    {
                        start:" قال تعالى:",
                        prayer:" ﴿ وَقُلْ رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرَّاحِمِينَ ﴾" ,
                         reference:"[المؤمنون: 118]."
                    },
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ وَقُلْ رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا ﴾" ,
                         reference:"[الإسراء: 80]."
                    },
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ وَقُلْ رَبِّ زِدْنِي عِلْمًا ﴾" ,
                         reference:"[طه: 114]."
                    },
                    {
                        start:" قال تعالى:",
                        prayer:"﴿ وَقُلْ رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ * وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ ﴾" ,
                         reference:"[المؤمنون: 97، 98]."
                    },
                ]
            }

    ]
}

export default prayers

